; domain
; Source: https://github.com/AI-Planning/pddl-generators/tree/main/miconic
; Fix: prevent the elevator from boarding served passengers => (not (origin ?p ?f)) effect added to board action
(define (domain miconic)
  (:requirements :strips :typing)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (and (boarded ?p) (not (origin ?p ?f))))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem miconic-05)
(:domain miconic)
(:objects
    p1 p2 - passenger
    f1 f2 - floor
)
(:init
    (lift-at f2)
    (origin p1 f2)
    (origin p2 f1)
    (destin p1 f1)
    (destin p2 f2)
    (above f1 f2)
)
(:goal  (and
    (served p1)
    (served p2)
)))

; plan
1. (board f2 p1)
   deleted: (origin p1 f2)
   added: (boarded p1)
   goals met: 0 of 2
2. (down f2 f1)
   deleted: (lift-at f2)
   added: (lift-at f1)
   goals met: 0 of 2
3. (board f1 p2)
   deleted: (origin p2 f1)
   added: (boarded p2)
   goals met: 0 of 2
4. (depart f1 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 1 of 2
5. (up f1 f2)
   deleted: (lift-at f1)
   added: (lift-at f2)
   goals met: 1 of 2
6. (depart f2 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 2 of 2
